**Data pre-processing**



Installing Libraries

In [ ]:
!pip install pandas

**Importing libraries**

In [ ]:
import pandas as pd

Read Dataset                                      
Use the **read_csv()** function of pandas to read the file                             
Mention Correct File path(location)                                                                                                 
Name of Dataset :abc.csv
Contains 
 
 Country              Age               Salary                Purchased
                                                                              
France                44.0               72000.0                No                                      

Spain  27.0  48000.0       Yes 


Germany  30.0  54000.0        No

Spain  38.0  61000.0        No

Germany  40.0      NaN       Yes

France  35.0  58000.0       Yes

Spain   NaN  52000.0        No

France  48.0  79000.0       Yes

Germany  50.0  83000.0        No

France  37.0  67000.0       Yes

In [ ]:
df = pd.read_csv("/content/drive/MyDrive/Colab Notebooks/abc.csv",encoding='latin-1')
print(df)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

**Finding Missing  Data**                                                                                                                                                                                                                                              The function isna(), which returns TRUE if an cell of the dataset if NaN or not.

In [ ]:
df.isna()

   Country    Age  Salary  Purchased
0    False  False   False      False
1    False  False   False      False
2    False  False   False      False
3    False  False   False      False
4    False  False    True      False
5    False  False   False      False
6    False   True   False      False
7    False  False   False      False
8    False  False   False      False
9    False  False   False      False

**Display count how many missing values there are for each column.**

In [ ]:
df.isna().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

**Display the  count percentage of missing values for each column**

In [ ]:
print(df.isna().sum()/len(df)*100)

Country       0.0
Age          10.0
Salary       10.0
Purchased     0.0
dtype: float64

**fillna():** **The fillna() function replaces all the NaN values with the value passed as argument.**

In [ ]:
print(df.fillna(12))

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0     12.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  12.0  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

**The fillna() function replaces all the NaN values with the mean of same column as argument.**

In [ ]:
print(df.fillna(df.mean()))

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  """Entry point for launching an IPython kernel.

**Replace a missing value over a column, with the interpolation between the previous and the next ones.**

In [ ]:
print(df.interpolate())

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0  59500.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  41.5  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

**Data binning (or bucketing) groups data in bins (or buckets)**, 
in the sense that it replaces values contained into a small interval with a single representative value for that interval.                                                                         
20 to 30 : Youth,                                                                    
30 to 40 : Adult,                                                                      
40 to 50 : Senior,

In [ ]:
bins=[20,30,40,50]

groups_name=['youth','adult','senior']

df['age_category']=pd.cut(df['Age'],bins,labels=groups_name)

print(df)

   Country   Age   Salary Purchased age_category
0   France  44.0  72000.0        No       senior
1    Spain  27.0  48000.0       Yes        youth
2  Germany  30.0  54000.0        No        youth
3    Spain  38.0  61000.0        No        adult
4  Germany  40.0      NaN       Yes        adult
5   France  35.0  58000.0       Yes        adult
6    Spain   NaN  52000.0        No          NaN
7   France  48.0  79000.0       Yes       senior
8  Germany  50.0  83000.0        No       senior
9   France  37.0  67000.0       Yes        adult